W5D1/music_app_capybara/app/views/albums/show.html.erb

SELECT "tracks".* FROM "tracks" WHERE (tracks.album_id = 1)
---
<ul>
  <% tracks = Track.where(["tracks.album_id = ?", @album.id]) %>