W5D1/music_app_capybara/app/views/bands/show.html.erb

    <h3>
    <% albums = Album.where(["albums.band_id = ?", @band.id]) %>
---
SELECT "albums".* FROM "albums" WHERE (albums.band_id = 1)