W5D1/music_app_capybara/app/controllers/albums_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 3]]
---
  def destroy
    album = Album.find(params[:id])
    album.destroy

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "albums" SET "year" = $1 WHERE "albums"."id" = $2  [["year", 1982], ["id", 3]]
---
  def update
    @album = Album.find(params[:id])
    if @album.update(album_params)