W5D1/music_app_capybara/app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id]) #
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]